<?php
return [
    'roles' => [
        'STUDENT' => "student",
        'TEACHER' => "teacher",
        'ADMIN' => "admin",
        'NONE' => "none", //if user stops being a student (is deleted from students) 
                        // so the account can still be used to make them a student or a teacher again  
    ],
    'departments' => [
        'АКІТ' => "Кафедра автоматизації та комп'ютерно-інтегрованих технологій",
        'ІПЗ' => "Кафедра інженерії програмного забезпечення",
        'ІІС' => "Кафедра інтелектуальних інформаційних систем",
        'КІ' => "Кафедра комп'ютерної інженерії",
        'ВМ' => "Кафедра прикладної та вищої математики",
    ],
    'exams' => [
        'З' => "Залік",
        'І' => "Іспит",
        'А' => "Атестація",
        'КР' => "Курсова робота",
        'ДР' => "Дипломна робота",
    ],
    'majors' => [
        '121' => "Інженерія програмного забезпечення",
        '122' => "Комп'ютерні науки",
        '123' => "Комп'ютерна інженерія",
        '124' => "Системний аналіз",
        '151' => "Автоматизація та комп'ютерно-інтегровані технології",
    ],
    'courses' => [
        '1' => "1",
        '2' => "2",
        '3' => "3",
        '4' => "4",
        '5' => "5",
        '6' => "6",
    ],
];